tests/data/invoices/v2/invoice_all_na.json

{
  "api_request": {
    "error": {},
    "resources": [
      "document"
    ],
    "status": "success",
    "status_code": 201,
    "url": "http://api.mindee.net/v1/products/mindee/invoices/v2/predict?include_mvision=True"
  },
  "document": {
    "annotations": {
      "labels": []
    },
    "id": "dffeef9c-dc36-4688-9973-c0f1b6af2b05",
    "inference": {
      "finished_at": "2021-08-24T08:07:06+00:00",
      "pages": [
        {
          "id": 0,
          "prediction": {
            "company_registration": [],
            "date": {
              "confidence": 0.0,
              "polygon": [],
              "value": null
            },
            "document_type": {
              "value": "INVOICE"
            },
            "due_date": {
              "confidence": 0.0,
              "polygon": [],
              "raw": null,
              "value": null
            },
            "invoice_number": {
              "confidence": 0.0,
              "polygon": [],
              "value": null
            },
            "locale": {
              "confidence": 0.36,
              "currency": null,
              "language": null
            },
            "orientation": {
              "confidence": 0.99,
              "degrees": 0
            },
            "payment_details": [],
            "supplier": {
              "confidence": 0.0,
              "polygon": [],
              "value": null
            },
            "taxes": [],
            "total_excl": {
              "confidence": 0.0,
              "polygon": [],
              "value": null
            },
            "total_incl": {
              "confidence": 0.0,
              "polygon": [],
              "value": null
            }
          }
        }
      ],
      "prediction": {
        "company_registration": [],
        "date": {
          "confidence": 0.0,
          "page_id": null,
          "polygon": [],
          "value": null
        },
        "document_type": {
          "value": "INVOICE"
        },
        "due_date": {
          "confidence": 0.0,
          "page_id": null,
          "polygon": [],
          "raw": null,
          "value": null
        },
        "invoice_number": {
          "confidence": 0.0,
          "page_id": null,
          "polygon": [],
          "value": null
        },
        "locale": {
          "confidence": 0.36,
          "currency": "EUR",
          "language": "fr"
        },
        "payment_details": [],
        "supplier": {
          "confidence": 0.0,
          "page_id": 0,
          "polygon": [],
          "value": null
        },
        "taxes": [],
        "total_excl": {
          "confidence": 0.0,
          "page_id": null,
          "polygon": [],
          "value": null
        },
        "total_incl": {
          "confidence": 0.0,
          "page_id": null,
          "polygon": [],
          "value": null
        }
      },
      "processing_time": 1.641,
      "product": {
        "features": [
          "locale",
          "invoice_number",
          "date",
          "due_date",
          "total_incl",
          "total_excl",
          "taxes",
          "document_type",
          "payment_details",
          "company_registration",
          "supplier",
          "orientation"
        ],
        "name": "mindee/invoices",
        "type": "standard",
        "version": "2.1"
      },
      "started_at": "2021-08-24T08:07:05+00:00"
    },
    "n_pages": 1,
    "name": "document",
    "ocr": {}
  },
  "document_type": "invoice",
  "input_type": "path",
  "filename": "passport.jpeg",
  "filepath": "./tests/data/passport/passport.jpeg",
  "file_extension": "image/jpeg"
}